src/cfe/InformationRegisters/OData4_ПрофилиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_ПрофилиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.OData4_Профили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/Catalogs/OData4_Профили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>OData4_Профили</Name>
			<Hierarchical>false</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РазмерСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаибольшийTop</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаExpand</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаговApply</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложностьФильтра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацийBatch</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Права</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разрешено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсключённыеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выражение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыШаблоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторЗначения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛимитыЧастоты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Запросов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Секунд</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/CommonModules/OData4_ПроверкаУдаления/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Чек-лист физического удаления для вкладки «Удаление» формы настроек (план 6.3, решение 8): Массив Структура
// «Пункт, Состояние, Факт». Состояние — «Да» (условие выполнено), «Нет» (не выполнено) или пустая строка
// (справка без проверки). Факты — по данным базы на момент вызова. Настройки — Структура, как
// OData4_НастройкиСервиса.Прочитать() (форма передаёт значения со своих полей); не переданы — читаются.
Функция Пункты(Настройки = Неопределено) Экспорт
	Если Настройки = Неопределено Тогда
		Настройки = OData4_НастройкиСервиса.Прочитать();
	КонецЕсли;
	Результат = Новый Массив;

	Включено = Настройки.РазрешитьФизическоеУдаление = Истина;
	ДобавитьПункт(Результат, "Режим DELETE — физическое удаление по праву профиля", Включено,
		?(Включено, "Включён.", "Выключен: DELETE ставит пометку удаления."));

	Профили = ПрофилиСФизическимУдалением();
	ДобавитьПункт(Результат, "Права профиля «Физическое удаление» и «Удаление»",
		Профили.Количество() > 0,
		?(Профили.Количество() = 0, "Нет ни у одного профиля.", "Профилей: " + Формат(Профили.Количество(), "ЧГ=0")
		+ " (" + Перечень(Профили) + ")."));

	// В режиме «Привилегированный» (только без безопасного режима OData4) права 1С служебной учётки не действуют
	// (наблюдение приёмки 6.3): её не проверяем; пользователей Basic с профилем — проверяем.
	Режим = "";
	Настройки.Свойство("РежимПравСлужебногоПользователя", Режим);
	Привилегированный = Режим = "Привилегированный";
	Учётки = УчёткиДляПроверки(Настройки, Профили, Привилегированный);
	Если Привилегированный И Учётки.Количество() = 0 Тогда
		Права = Новый Структура("Выполнено, Факт", Истина, "");
	Иначе
		Права = ПраваНаУдаление(Учётки);
	КонецЕсли;
	Если Привилегированный Тогда
		Права.Факт = СокрЛП("Служебным учёткам права 1С не нужны: режим «Привилегированный». " + Права.Факт);
	КонецЕсли;
	ДобавитьПункт(Результат, "Право 1С «Удаление» (не «Интерактивное удаление») у служебных учёток и пользователей Basic "
		+ "с такими профилями", Права.Выполнено, Права.Факт);

	ДобавитьПункт(Результат, "Ссылки на удалённый объект", Неопределено, ФактСсылок());
	ДобавитьПункт(Результат, "Необратимость", Неопределено, "Физически удалённый объект восстанавливается только из "
		+ "резервной копии базы.");
	Возврат Результат;
КонецФункции

// Имена профилей (не помеченных на удаление), которые могут физически удалить хоть что-то: есть объект, на котором
// по правилам профиля действуют и «Удаление», и «Физическое удаление» (решение 36 плана 6.2; дефекты Д3 и Д3′
// приёмки 6.3). Права считаются по объекту той же функцией, что у записи 6.2 (OData4_Профили.Разрешено):
// проверяются объекты из строк прав профиля и ссылочные объекты действующего состава (для правил вида и «*»).
// По алфавиту.
Функция ПрофилиСФизическимУдалением() Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	П.Ссылка КАК Ссылка,
		|	П.Ссылка.Наименование КАК Наименование,
		|	П.Объект КАК Объект
		|ИЗ
		|	Справочник.OData4_Профили.Права КАК П
		|ГДЕ
		|	НЕ П.Ссылка.ПометкаУдаления
		|	И П.Ссылка В
		|			(ВЫБРАТЬ
		|				Ф.Ссылка
		|			ИЗ
		|				Справочник.OData4_Профили.Права КАК Ф
		|			ГДЕ
		|				Ф.Операция = ""ФизическоеУдаление""
		|				И Ф.Разрешено)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование");
	Строки = Запрос.Выполнить().Выгрузить();
	Результат = Новый Массив;
	Если Строки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	Состав = ОбъектыСостава();
	Ссылки = Строки.Скопировать(, "Ссылка");
	Ссылки.Свернуть("Ссылка");
	Для Каждого Ссылка Из Ссылки.ВыгрузитьКолонку("Ссылка") Цикл
		Описание = OData4_Профили.Описание(Ссылка);
		Объекты = Новый Массив;
		Для Каждого Строка0 Из Строки.НайтиСтроки(Новый Структура("Ссылка", Ссылка)) Цикл
			Если СтрНайти(Строка0.Объект, ".") > 0 Тогда
				Объекты.Добавить(СокрЛП(Строка0.Объект));
			КонецЕсли;
		КонецЦикла;
		Для Каждого ПолноеИмя Из Состав Цикл
			Объекты.Добавить(ПолноеИмя);
		КонецЦикла;
		Для Каждого ПолноеИмя Из Объекты Цикл
			Если OData4_Профили.Разрешено(Описание, ПолноеИмя, "ФизическоеУдаление")
				И OData4_Профили.Разрешено(Описание, ПолноеИмя, "Удаление") Тогда
				Результат.Добавить(Ссылка.Наименование);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат OData4_Модель.УпорядочитьСтроки(Результат);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПункт(Результат, Пункт, Выполнено, Факт)
	Состояние = "";
	Если Выполнено = Истина Тогда
		Состояние = "Да";
	ИначеЕсли Выполнено = Ложь Тогда
		Состояние = "Нет";
	КонецЕсли;
	Результат.Добавить(Новый Структура("Пункт, Состояние, Факт", Пункт, Состояние, Факт));
КонецПроцедуры

// Первые пять имён через запятую, остальные — числом.
Функция Перечень(Имена)
	Первые = Новый Массив;
	Для Каждого Имя Из Имена Цикл
		Если Первые.Количество() = 5 Тогда
			Прервать;
		КонецЕсли;
		Первые.Добавить(Имя);
	КонецЦикла;
	Текст = СтрСоединить(Первые, ", ");
	Если Имена.Количество() > Первые.Количество() Тогда
		Текст = Текст + " и ещё " + Формат(Имена.Количество() - Первые.Количество(), "ЧГ=0");
	КонецЕсли;
	Возврат Текст;
КонецФункции

// Учётки, которым нужно право 1С «Удаление»: служебные учётки публикации токенов (запросы по токенам идут от
// их имени) и пользователи Basic, которым назначен профиль с физическим удалением.
Функция УчёткиДляПроверки(Настройки, Профили, БезСлужебных = Ложь)
	Учётки = Новый Массив;
	Служебные = "";
	Настройки.Свойство("СлужебныеПользователи", Служебные);
	Если ТипЗнч(Служебные) = Тип("Строка") И Не БезСлужебных Тогда
		Для Каждого Имя Из СтрРазделить(Служебные, Символы.ПС + ",", Ложь) Цикл
			Если Не ПустаяСтрока(Имя) И Учётки.Найти(СокрЛП(Имя)) = Неопределено Тогда
				Учётки.Добавить(СокрЛП(Имя));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Профили.Количество() = 0 Тогда
		Возврат Учётки;
	КонецЕсли;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	П.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.OData4_ПрофилиПользователей КАК П
		|ГДЕ
		|	П.Профиль.Наименование В (&Профили)
		|	И НЕ П.Профиль.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Пользователь");
	Запрос.УстановитьПараметр("Профили", Профили);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Учётки.Найти(Выборка.Пользователь) = Неопределено Тогда
			Учётки.Добавить(Выборка.Пользователь);
		КонецЕсли;
	КонецЦикла;
	Возврат Учётки;
КонецФункции

// Полные имена ссылочных объектов действующего состава (виды, которые DELETE удаляет).
Функция ОбъектыСостава()
	Результат = Новый Массив;
	Для Каждого КлючИЗначение Из OData4_Состав.ДействующийСостав() Цикл
		Если ВидыСсылок().Найти(СтрРазделить(КлючИЗначение.Ключ, ".")[0]) <> Неопределено Тогда
			Результат.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Право 1С «Удаление» учёток на ссылочные объекты действующего состава: Структура «Выполнено, Факт».
// Выполнено — у каждой учётки право есть хотя бы на один объект; учёток нет — Ложь.
Функция ПраваНаУдаление(Учётки)
	Итог = Новый Структура("Выполнено, Факт", Ложь, "");
	Если Учётки.Количество() = 0 Тогда
		Итог.Факт = "Проверять некого: служебные учётки не отмечены, профиль с физическим удалением никому не "
			+ "назначен. Basic без профиля удаляет физически по своему праву 1С «Удаление».";
		Возврат Итог;
	КонецЕсли;
	Объекты = Новый Массив;
	Для Каждого КлючИЗначение Из OData4_Состав.ДействующийСостав() Цикл
		Вид = СтрРазделить(КлючИЗначение.Ключ, ".")[0];
		Если ВидыСсылок().Найти(Вид) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(КлючИЗначение.Ключ);
		Если ОбъектМетаданных <> Неопределено Тогда
			Объекты.Добавить(ОбъектМетаданных);
		КонецЕсли;
	КонецЦикла;
	Всего = Формат(Объекты.Количество(), "ЧН=0; ЧГ=0");
	Факты = Новый Массив;
	Итог.Выполнено = Истина;
	Для Каждого Имя Из Учётки Цикл
		Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Имя);
		Если Пользователь = Неопределено Тогда
			Факты.Добавить(Имя + ": нет такого пользователя ИБ");
			Итог.Выполнено = Ложь;
			Продолжить;
		КонецЕсли;
		СПравом = 0;
		Для Каждого ОбъектМетаданных Из Объекты Цикл
			Если ПравоДоступа("Удаление", ОбъектМетаданных, Пользователь) Тогда
				СПравом = СПравом + 1;
			КонецЕсли;
		КонецЦикла;
		Если СПравом = 0 Тогда
			Итог.Выполнено = Ложь;
		КонецЕсли;
		Факты.Добавить(Имя + ": " + Формат(СПравом, "ЧН=0; ЧГ=0") + " из " + Всего);
	КонецЦикла;
	Итог.Факт = "Ссылочных объектов состава с правом: " + СтрСоединить(Факты, "; ") + ".";
	Возврат Итог;
КонецФункции

// Виды объектов, которые DELETE удаляет (ссылочные): у регистров право «Удаление» не выдаётся.
Функция ВидыСсылок()
	Возврат СтрРазделить("Справочник,Документ,ПланВидовХарактеристик,ПланСчетов,ПланВидовРасчета,ПланОбмена,"
		+ "БизнесПроцесс,Задача", ",");
КонецФункции

// Проверка ссылок при удалении: программное Удалить() ссылки не проверяет, поэтому их ищет запись 6.2 (решение 30
// плана 6.2: есть ссылки — 409); помеченные с проверкой ссылок удаляет обработка удаления помеченных объектов (в
// конфигурациях на БСП — подсистема «Удаление помеченных объектов»).
Функция ФактСсылок()
	Текст = "Перед физическим удалением сервис ищет ссылки на объект: если они есть — ответ 409, объект остаётся.";
	Если Метаданные.ОбщиеМодули.Найти("УдалениеПомеченныхОбъектов") <> Неопределено Тогда
		Возврат Текст + " Проведённый документ на БСП обычно так не удаляется: на него ссылаются служебные записи "
			+ "проведения. Помеченные объекты с проверкой ссылок удаляются обработкой БСП «Удаление помеченных объектов».";
	КонецЕсли;
	Возврат Текст + " Помеченные объекты с проверкой ссылок удаляются штатной обработкой платформы «Удаление "
		+ "помеченных объектов».";
КонецФункции

#КонецОбласти
